{"meta":{"title":"Naija Startup Guide","subtitle":null,"description":null,"author":"Lucky Uhuns","url":"https://luckyuhuns.github.io/naija-startup-guide","root":"/naija-startup-guide/"},"pages":[],"posts":[{"title":"How to Use WhatsApp for Small Business in Nigeria: 2019","slug":"How-to-Use-WhatsApp-for-Small-Business-in-Nigeria-2019","date":"2019-04-13T20:00:51.000Z","updated":"2019-04-14T00:05:22.684Z","comments":true,"path":"2019/04/13/How-to-Use-WhatsApp-for-Small-Business-in-Nigeria-2019/","link":"","permalink":"https://luckyuhuns.github.io/naija-startup-guide/2019/04/13/How-to-Use-WhatsApp-for-Small-Business-in-Nigeria-2019/","excerpt":"","text":"Started as a simple messenger app back in 2009 with image and video sharing features.Fast forward 10years on, it the most used messaging app in the world, currently having about 1.5 billion users worldwide. In Nigeria, not only is it the most used messenger app, it is the most used social media app in Nigeria according to Hootsuite’s The Global State of Digital in 2019 report. According to the report, Nigeria has 98.39million internet users with 24million users having an active social media account.WhatsApp is the most active social media platform in the country with 85% (20.4 million) of users. The second is Facebook at 78%, Instagram is third at 57%, followed by Facebook Messenger at 54% and Youtube at 53%. What does this mean for a small business owner in Nigeria? It means the majority of your customers and potential customers that have access to the internet are actively on WhatsApp. That is where you actively should be doing business as well. Outline Introduction to WhatsApp business App Features and how they can help small businesses• Business Profile• Quick Replies• Away Message• Greeting Message• Labels• Account Verification Final thoughts Whatsapp Business In 2018 WhatsApp launched the WhatsApp business app. The goal was to have a separate app dedicated to business interactions. Prior to the launch of whatsApp Business, people had already been using WhatsApp messenger to connect with customers. It, however, has some limitations for business. For instance, on the WhatsApp messenger, you don’t have fields to fill in business information like address, email and website or automating interactions with customers. These are necessary when you’re having a growing customer base. WhatsApp launched the WhatsApp business to address those limitations. According to the WhatsApp official website, WhatsApp business is free to download and was built with the small business owner in mind.With the app, businesses can interact with customers seamlessly by using tools to automate, sort and quickly respond to messages. With the WhatsApp business app, you can still do all the regular things you do with WhatsApp messenger. however, you cant use WhatsApp messenger and WhatsApp business on the same phone number. It has to be different phone numbers. Features of WhatsApp businessBusiness ProfileWith WhatsApp business, you can add more information about your business, compared to WhatsApp messenger. Information like the physical address of your business, google map, the category of your business, opening times and an about section where you can write a little about your business This is like a mini webpage for your customers on WhatsApp. Quick RepliesWhatsapp quick reply feature helps you reply to common questions from your customers with little hassle. How it works is that you save replies to common questions and reuse them whenever the same questions are asked. This feature is incredibly helpful in a lot of ways. Let’s assume you sell barbequed fish (yummy!), and you have 10 customers asking you what your payment options are. Your ideal reply might be “we accept cash or bank transfers to xxx account number, account name: john doe, Bank: Hakuna Matata bank” Replying that line to 10 customers is a whole lot of work. With the quick reply feature, all you need to do is save the line “we accept cash or bank transfers to xxx account number, account name: john doe, Bank: Hakuna Matata bank” with a keyword like ‘payment’. So whenever a client ask what your payment options are, all you do is type “/payment”, you will see your saved reply pop up on a scrolling window. When you tap a key word, your reply gets sent. Additionally, when you type ‘/’ all your quick replies show up.To add a quick reply, go to settings – business settings - quick replies, then add your quick replies Automated Away message the key to successfully using social media for business is engagement. Whatsapp Away Message feature lets you do just that even when you are offline or busy. To use the away message feature, you set a customized away message which gets sent automatically to customers whenever they send a message. To add automated away message, Go to Settings – Business settings – Away message (Under messaging tools) Automated Greeting MessageThe Greeting Message feature functions in a similar way to the away message as they are both triggered automatically when a customer sends a message. Just like the name implies, it is meant to greet a customer the moment they send a message. Think about it, when you go to a physical store to do whatever people do in stores. You know you feel important and excited to do business when you are welcomed with warm greetings.You can customize messages like: “Hey there, I am Jon Snow. Welcome to Westeros fashion, how can we be of service to you”. When enabled, your customers get that reply when they send a message. Greeting Message will automatically send another Greeting Message to a customer that has not replied after 14days.To enable greeting message Goto SETTINGS –BUSINESS SETTINGS – GREETING MESSAGE then change the default greeting message to your own. LabelsLabels on WhatsApp business basically lets you organize your customers chat into groups. For example, if you have a bunch of customers that are yet to make payments for your product, you can add a label like “Yet to Pay” to all of them. The same thing with labels for “New Customers (included by default), Order Complete or One Word Replies”. This feature is quite handy because it helps you organize your business contacts and keep track of your engagement with your customers. Verified WhatsApp business numberThese days of spam contents, internet fraud, and other illicit activities going on online. Just like on Facebook and Instagram, a verified WhatsApp business account helps people know that you are who you say you are. It helps people interacting with your business know you are the legit owner. A verified WhatsApp business account has the green tick like the one in the image above.Before your account can be verified, you have to meet certain requirements listed on the WhatsApp official website. If you meet those requirements, then verifying your account is just a few steps away Enter your phone number:o Choose your country from the drop-down list. This will automatically fill in your country code in the box on the left.o Enter your phone number in the box on the right. Don’t put a 0 before your phone number. Tap Next to receive a verification code. If prompted, you can also tap Call me to receive the code via phone call. Enter the 6-digit verification code you receive via SMS or phone call.Voila!!! Your account is Verified. Final ThoughtsWhatsapp business is a great tool every small business in Nigeria should have because it makes it easier to connect with customers. according to statistics, a lot of people use WhatsApp in this part of the world. bringing your business closer to your customers is always going to be a plus. The features the app comes with can help small businesses manage customer service relation (which is a crucial part of every business) with little effort.What aspect(s) of your business do you use WhatsApp for? drop your comment on the comment section.","categories":[{"name":"Digital Marketing","slug":"Digital-Marketing","permalink":"https://luckyuhuns.github.io/naija-startup-guide/categories/Digital-Marketing/"},{"name":"Social Media","slug":"Digital-Marketing/Social-Media","permalink":"https://luckyuhuns.github.io/naija-startup-guide/categories/Digital-Marketing/Social-Media/"}],"tags":[{"name":"WhatsApp","slug":"WhatsApp","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/WhatsApp/"},{"name":"Social Media","slug":"Social-Media","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/Social-Media/"},{"name":"Messaging","slug":"Messaging","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/Messaging/"},{"name":"Business","slug":"Business","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/Business/"},{"name":"Money","slug":"Money","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/Money/"}]},{"title":"How to Use Social Media to Increase Your Sales","slug":"How-to-use-social-media-to-increase-your-sales","date":"2019-04-11T20:01:23.000Z","updated":"2019-04-11T21:59:25.643Z","comments":true,"path":"2019/04/11/How-to-use-social-media-to-increase-your-sales/","link":"","permalink":"https://luckyuhuns.github.io/naija-startup-guide/2019/04/11/How-to-use-social-media-to-increase-your-sales/","excerpt":"","text":"What actually is social sellingSocial selling is basically finding prospective customers and engaging them with relevant content. It is a long term process which involves building relationships, as opposed to traditional selling. Traditional selling is a fast, straight forward approach which is all about making short term sales. The problem is that, allot of small businesses trying to sell online use same old traditional techniques. What the stats sayAs of 2019, it is estimated that there is around 2.77 billion social Media users on the planet.That number is expected to rise to 3.02 billion by 2021.Obviously this is a goldmine for a business owner. This is where you want to be marketing your products. Identify where your prospective customers areThere are allot of social media platforms out there. It is certainly unrealistic to be active on every one of them. You need to identify which platform(s) your prospective customers would be. Because each social media platform is different in the way we use them, In other to know where your prospective buyers are, you should have mental picture of who your ideal buyer is. This is your buyer persona.You have to know what their goals are, what demographic they belong to. To better illustrate, let’s assume you sell female beauty products like makeup kits.Your buyer persona might be 18 – 25 year old female student or 27 – 35 year old working class female.Their goals might be to look good for the next faculty dinner party and for work on Monday respectively. You would expect to find these group on social media platform like Instagram.That is because they are most likely to share their good looks on a picture based social media platform. That is where you want to be marketing your makeup kits.The same applies for other social media platforms. Social selling gone wrongLet’s consider the Instagram post below. It is a post from a foot wear seller. The post contains a single image of the hair extension or a college of different hair extensions with a caption that reads “slippers with class, 11k, send a DM (direct message)”. All other posts from this seller are similar to this.While this might not entirely be an ineffective approach, the seller might have problems making long-term customers. Aside the image of pair of slipper, the only message I see there is a seller who just wants to sell products and who cares not for my interest. You need to understand that buying, whether physical product or service, is an emotional act. We buy from people we like, and people we like are people we who have our best interest at heart. In other words we buy from people who makes it known to us that they want us to get the best of what they are offering. Let’s consider a hypothetical scenario where you slept and had one those dreams that comes with several episodes in one night (I have that allot). On the first episode, you went to a retail store along the street to purchase a headphone. You ask the store guy to recommend a high quality one for you. He was like, “buy xxx headphone, its 10,000naira, people have been purchasing it all morning, buy now before it runs out of stock”. Next the universe switches you to the next episode. You find yourself walking to another headphone retail store across the street. On getting inside, you meet a polite store guy. You ask him for a headphone recommendation.He brought out xxx headphone and he was like, “you look like someone who workout regularly. If you do or you plan on doing so someday, this is the perfect headphone for you. It doesn’t slip and it has a tight grip. There are some that are way cheaper than this, however they don’t have the surround sound feature as this. You know that by the Dolby logo inscribed close to the speakers”. If you were to make a choice on whom to patronise between both stores, which will it be?Personally I would go with the second store. Why?The store guy wasn’t just interested in selling a product to me. He cared for my interest. He wanted me to get the best product. He educated me on the product. He even gave me ideas on things I could do with the headphone (workout). At this point, I see him as an industry expert in headphones. I trust that guy. i bet i’ll come a second time. DON’T JUST TRY TO SELL, ENGAGE WITH RELEVANT CONTENT Some of the mistakes I see allot of small businesses trying to sell online do in this part of the world (Nigeria) are:The assumption every potential buyero Is knowledgeable about the product.o Knows the product actually exists.o Knows the product will solve their problemso Know they actually have a problem to be solved With those assumptions, you will only be selling to a few at the end of their buyer’s journey.Accenture’s study, state of B2B procurement study, finds that, before making a purchase, 94% of B2B (business to business) buyers make some degree of research online. 55% of those buyers conducts research for at least half of their purchase.The goal here is to provide the information when they make that research which will build your reputation as an expert in your industry.this will ultimately drive sales up. Don’t post images of products and their prices, create content that educate your buyers about that product or service. Video review of a product Pros and cons of a product How to best use a product How to best care for a product Complementary products How a product is made How to spot fakeThe secret is identifying the needs of your potential customers and helping them with those needs. The core of your marketing strategy should be about them. What sort of content do you engage your audience with on social media?","categories":[{"name":"Digital Marketing","slug":"Digital-Marketing","permalink":"https://luckyuhuns.github.io/naija-startup-guide/categories/Digital-Marketing/"}],"tags":[{"name":"social media","slug":"social-media","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/social-media/"},{"name":"instagram","slug":"instagram","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/instagram/"},{"name":"content","slug":"content","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/content/"}],"author":"lucky uhuns"}]}