{"meta":{"title":"Naija Startup Guide","subtitle":null,"description":null,"author":"Lucky Uhuns","url":"https://luckyuhuns.github.io/naija-startup-guide","root":"/naija-startup-guide/"},"pages":[],"posts":[{"title":"How to Use Social Media to Increase Your Sales","slug":"How-to-use-social-media-to-increase-your-sales","date":"2019-04-11T20:01:23.000Z","updated":"2019-04-11T21:59:25.643Z","comments":true,"path":"2019/04/11/How-to-use-social-media-to-increase-your-sales/","link":"","permalink":"https://luckyuhuns.github.io/naija-startup-guide/2019/04/11/How-to-use-social-media-to-increase-your-sales/","excerpt":"","text":"What actually is social sellingSocial selling is basically finding prospective customers and engaging them with relevant content. It is a long term process which involves building relationships, as opposed to traditional selling. Traditional selling is a fast, straight forward approach which is all about making short term sales. The problem is that, allot of small businesses trying to sell online use same old traditional techniques. What the stats sayAs of 2019, it is estimated that there is around 2.77 billion social Media users on the planet.That number is expected to rise to 3.02 billion by 2021.Obviously this is a goldmine for a business owner. This is where you want to be marketing your products. Identify where your prospective customers areThere are allot of social media platforms out there. It is certainly unrealistic to be active on every one of them. You need to identify which platform(s) your prospective customers would be. Because each social media platform is different in the way we use them, In other to know where your prospective buyers are, you should have mental picture of who your ideal buyer is. This is your buyer persona.You have to know what their goals are, what demographic they belong to. To better illustrate, let’s assume you sell female beauty products like makeup kits.Your buyer persona might be 18 – 25 year old female student or 27 – 35 year old working class female.Their goals might be to look good for the next faculty dinner party and for work on Monday respectively. You would expect to find these group on social media platform like Instagram.That is because they are most likely to share their good looks on a picture based social media platform. That is where you want to be marketing your makeup kits.The same applies for other social media platforms. Social selling gone wrongLet’s consider the Instagram post below. It is a post from a foot wear seller. The post contains a single image of the hair extension or a college of different hair extensions with a caption that reads “slippers with class, 11k, send a DM (direct message)”. All other posts from this seller are similar to this.While this might not entirely be an ineffective approach, the seller might have problems making long-term customers. Aside the image of pair of slipper, the only message I see there is a seller who just wants to sell products and who cares not for my interest. You need to understand that buying, whether physical product or service, is an emotional act. We buy from people we like, and people we like are people we who have our best interest at heart. In other words we buy from people who makes it known to us that they want us to get the best of what they are offering. Let’s consider a hypothetical scenario where you slept and had one those dreams that comes with several episodes in one night (I have that allot). On the first episode, you went to a retail store along the street to purchase a headphone. You ask the store guy to recommend a high quality one for you. He was like, “buy xxx headphone, its 10,000naira, people have been purchasing it all morning, buy now before it runs out of stock”. Next the universe switches you to the next episode. You find yourself walking to another headphone retail store across the street. On getting inside, you meet a polite store guy. You ask him for a headphone recommendation.He brought out xxx headphone and he was like, “you look like someone who workout regularly. If you do or you plan on doing so someday, this is the perfect headphone for you. It doesn’t slip and it has a tight grip. There are some that are way cheaper than this, however they don’t have the surround sound feature as this. You know that by the Dolby logo inscribed close to the speakers”. If you were to make a choice on whom to patronise between both stores, which will it be?Personally I would go with the second store. Why?The store guy wasn’t just interested in selling a product to me. He cared for my interest. He wanted me to get the best product. He educated me on the product. He even gave me ideas on things I could do with the headphone (workout). At this point, I see him as an industry expert in headphones. I trust that guy. i bet i’ll come a second time. DON’T JUST TRY TO SELL, ENGAGE WITH RELEVANT CONTENT Some of the mistakes I see allot of small businesses trying to sell online do in this part of the world (Nigeria) are:The assumption every potential buyero Is knowledgeable about the product.o Knows the product actually exists.o Knows the product will solve their problemso Know they actually have a problem to be solved With those assumptions, you will only be selling to a few at the end of their buyer’s journey.Accenture’s study, state of B2B procurement study, finds that, before making a purchase, 94% of B2B (business to business) buyers make some degree of research online. 55% of those buyers conducts research for at least half of their purchase.The goal here is to provide the information when they make that research which will build your reputation as an expert in your industry.this will ultimately drive sales up. Don’t post images of products and their prices, create content that educate your buyers about that product or service. Video review of a product Pros and cons of a product How to best use a product How to best care for a product Complementary products How a product is made How to spot fakeThe secret is identifying the needs of your potential customers and helping them with those needs. The core of your marketing strategy should be about them. What sort of content do you engage your audience with on social media?","categories":[{"name":"Digital Marketing","slug":"Digital-Marketing","permalink":"https://luckyuhuns.github.io/naija-startup-guide/categories/Digital-Marketing/"}],"tags":[{"name":"social media","slug":"social-media","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/social-media/"},{"name":"instagram","slug":"instagram","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/instagram/"},{"name":"content","slug":"content","permalink":"https://luckyuhuns.github.io/naija-startup-guide/tags/content/"}],"author":"lucky uhuns"},{"title":"Hello World","slug":"hello-world","date":"2019-04-09T19:18:57.258Z","updated":"2019-04-09T19:18:57.258Z","comments":true,"path":"2019/04/09/hello-world/","link":"","permalink":"https://luckyuhuns.github.io/naija-startup-guide/2019/04/09/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}